venkatesan-krishnamoorthy/mcupsdk-core/examples/drivers/ospi/ospi_flash_xip/am263px-cc/r5fss0-0_nortos/example.syscfg
section13.load_memory                  = "FLASH";
section13.$name                        = "FLASH_RODATA_AND_CODE_SECTION";
section13.output_section.create(3);
section13.output_section[0].palignment = true;
section13.output_section[0].alignment  = 32;
section13.output_section[0].$name      = ".rodata.crc";
section13.output_section[1].$name      = ".text.ospi_flash_xip_crc_test";
section13.output_section[1].alignment  = 32;
section13.output_section[1].palignment = true;
section13.output_section[2].$name      = ".text.crc16_ccitt";
section13.output_section[2].palignment = true;
section13.output_section[2].alignment  = 32;

section14.$name                                    = "cio_grp1";
section14.load_memory                              = "OCRAM";
section14.output_section.create(1);
section14.output_section[0].$name                  = "cio";
section14.output_section[0].palignment             = true;
section14.output_section[0].input_section.create(1);
section14.output_section[0].input_section[0].$name = "-llibsysbm.a<trgmsg.c.obj> (.text)";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.peripheralDriver.OSPI.$suggestSolution = "OSPI0";
i2c1.I2C.$suggestSolution                     = "I2C2";
i2c2.I2C.$suggestSolution                     = "I2C0";
i2c2.I2C.SCL.$suggestSolution                 = "I2C0_SCL";
i2c2.I2C.SDA.$suggestSolution                 = "I2C0_SDA";
